#1. Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа данных каждого элемента. Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
mood = "qiute good"
list = ('sun', 12.03, ['Europe', 'USA'], '**-%-|')
print(list)